app/controllers/api/items_controller.rb

SELECT "items".* FROM "items"
---
    def index
        render json: Item.all

INSERT INTO "items" ("name", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Carrot"], ["price", "80"], ["created_at", "2019-12-19 19:46:46.857293"], ["updated_at", "2019-12-19 19:46:46.857293"]]
---
    def create
        @item = Item.new(item_params)
        if @item.save

DELETE FROM "items" WHERE "items"."id" = $1  [["id", 4]]
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def destroy
        Item.find(params[:id]).destroy